In [1]:
#csv comma separated values

In [4]:
import pandas as pd

In [5]:
#uploading the csv file

In [7]:
data1=pd.read_csv('C:/Users/bhava/Downloads/edata.csv')

In [8]:
data

#csv data

   empno   ename    job   sal  deptno
0   1001    raju    dev  1200    10.0
1    102    ravi   test  1000    20.0
2    103   kumar  sales  1500    30.0
3   1004  venkat  sales  1600    30.0
4   1005    suri   test  1200     NaN
5   1006    hari    Dev  2300    20.0
6   1007    koti    dev  1900    10.0
7   1008   varma   test  2100    10.0

In [9]:
data2=pd.read_csv("C:/Users/bhava/Downloads/edata2.csv")

In [10]:
data2

  empno#ename#job#sal#deptno
0      1001#raju#dev#1200#10
1      102#ravi#test#1000#20
2    103#kumar#sales#1500#30
3  1004#venkat#sales#1600#30
4     1005#suri#test#1200#NA
5      1006#hari#dev#1700#20

In [11]:
#the above data is of # separated values
#to convert this into normal data the below code is written

In [13]:
data3=pd.read_csv('C:/Users/bhava/Downloads/edata2.csv',delimiter='#')
data3

   empno   ename    job   sal  deptno
0   1001    raju    dev  1200    10.0
1    102    ravi   test  1000    20.0
2    103   kumar  sales  1500    30.0
3   1004  venkat  sales  1600    30.0
4   1005    suri   test  1200     NaN
5   1006    hari    dev  1700    20.0

In [14]:
data3.shape

(6, 5)

In [15]:
data3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   empno   6 non-null      int64
 1   ename   6 non-null      object
 2   job     6 non-null      object
 3   sal     6 non-null      int64
 4   deptno  5 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 372.0+ bytes

In [16]:
data3.index

RangeIndex(start=0, stop=6, step=1)

In [17]:
data3.dtypes

empno       int64
ename      object
job        object
sal         int64
deptno    float64
dtype: object

In [19]:
data3.columns

Index(['empno', 'ename', 'job', 'sal', 'deptno'], dtype='object')

In [20]:
data.loc[0]

empno     1001
ename     raju
job        dev
sal       1200
deptno    10.0
Name: 0, dtype: object

In [21]:
data3.iloc[1,2]

'test'

In [22]:
data3.at[0,'job']

'dev'

In [25]:
data3.at[2,'ename']

'kumar'